[
  {
    "rota": "/project-hub",
    "title": "localizador-cep-react",
    "descriptionResumo": "Aplicação React que consulta a API ViaCEP para buscar informações de endereço a partir do CEP. Permite digitar um CEP, obter dados como UF, DDD, localidade, bairro e logradouro, e limpar o formulário. Interface responsiva com feedback visual para sucesso ou erro.",
    "descriptionCompleto": "Aplicação React para buscar informações de endereço a partir do CEP utilizando a API pública ViaCEP.\n\nEste projeto permite que você digite um CEP no formato 00000-000 e, ao clicar em buscar, ele consulta a API ViaCEP para retornar dados como UF, DDD, localidade, bairro, logradouro e o próprio CEP. Ele também oferece feedback visual para erros ou sucesso na busca e um botão para limpar os dados e o campo de entrada. A interface é responsiva para dispositivos móveis.\n\nA aplicação foi desenvolvida utilizando React, com hooks como useState, Axios para requisições HTTP, e CSS puro para a estilização.\n\nPara rodar o projeto localmente, você precisa ter o Node.js e o npm instalados na sua máquina. Caso não tenha, acesse nodejs.org para instalar.\n\nDepois, siga os passos:\n\nClone este repositório na sua máquina, usando o comando no terminal: git clone https://github.com/seu-usuario/localizador-cep-react.git\n\nEntre na pasta do projeto: cd localizador-cep-react\n\nInstale as dependências necessárias com o npm ou yarn: npm install\n\nInicie o servidor de desenvolvimento para rodar o app localmente: npm run dev\n\nSe quiser acessar a aplicação via outros dispositivos da mesma rede, como seu celular ou tablet, é recomendado iniciar o servidor expondo o host da máquina local. Para isso, use:\n\nnpm run dev -- --host\n\nOu ajuste sua configuração para que o servidor fique acessível via IP local.\n\nAgora, abra seu navegador e acesse: http://localhost: sua porta\nOu, se estiver acessando de outro dispositivo na mesma rede, substitua localhost pelo IP da sua máquina.\n\nSe quiser entrar em contato comigo, use:\n\nEmail: carlosvarao.frontend@hotmail.com\nLinkedIn: https://www.linkedin.com/in/carlosvaraofrontend\nGitHub: https://github.com/CarlosVarao\nFeito com ❤️ usando React e muita dedicação!",
    "tecnologias": [
      "React",
      "TypeScript",
      "Html",
      ".Css"
    ],
    "hrefGithub": "https://github.com/CarlosVarao/localizador-cep-react",
    "myVideo": "https://www.youtube.com/-nmZz21tzO4",
    "imgProjeto": "localizador-cep-react.png"
  }
]